package OOP_HomeWork2.Main;

/*Создать класс УчебнаяГруппа содержащая в себе поля Преподаватель и список Студентов
        Создать класс УчебнаяГруппаСервис, в котором реализована логика чтения Студентов и Преподавателя из файла TXT, создания класса УчебнаяГруппа и возвращения его
        Создать метод в Контроллере, в котором агрегируются юзеры
        Все вышеуказанное создать согласно принципам ООП пройдённым на семинаре
        Контроллер вызывает сервис, сервис вызывает util, util записывает в файловую систему */

import java.util.logging.Logger;

public class Main {
    public static void main(String[] args) {

        Logger loggerStudy = Logger.getAnonymousLogger();


    }
}

